# SetupEnergySimulationDialog Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SetupEnergySimulationDialog Properties
SetupEnergySimulationDialog Class See Also
---
The SetupEnergySimulationDialog type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ProjectId | The identifier of the project (on the Green Building Studio server) that was selected by the user. |
| ProjectName | The project name (representing a project on the Green Building Studio server) selected or supplied by the user. |
| RunName | The name of the analysis run that was supplied by the user. |

# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace